Revit 2027 API
ComboBoxMemberData.GroupName Property
Gets or sets a group name for the ComboBoxMember.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GroupName { get; set; }
Public Property GroupName As String
	Get
	Set
public:
property String^ GroupName {
	String^ get ();
	void set (String^ value);
}
member GroupName : string with get, set
Property Value
String
Remarks
The GroupName is used to group the items and also appears in the group header. All ComboBoxMembers assigned to the same group will be grouped in the ComboBox. There will be a header that shows the name. The default value is null.
See Also
Reference
ComboBoxMemberData Class
Autodesk.Revit.UI Namespace